{
  "id": "chandrila",
  "name": "Chandrila",
  "image": "images/chandrila.png",
  "description": "Chandrila is a Core World renowned for its longstanding traditions of civic responsibility, pacifist-leaning politics, and representative governance. With a landscape characterized by temperate climates, rolling hills, and carefully preserved natural spaces, the planet has long prided itself on balancing technological advancement with environmental stewardship. Prior to the rise of the Empire, Chandrila functioned as a prominent voice in the Galactic Senate, advocating for civil liberties, restraint in military affairs, and diplomatic solutions to interstellar disputes.\n\nThe planet’s most notable contribution to the Alliance is Mon Mothma, former senator and one of the primary leaders of the Rebellion. Her public denunciation of the Emperor’s abuses, delivered at great personal risk, directly challenged Imperial authority and forced her into open opposition. Chandrila’s cultural and political values—emphasis on individual rights, transparent governance, and shared responsibility—are reflected in many of the principles she later helped embed into the Alliance’s founding charters and long-term aspirations.\n\nUnder Imperial rule, Chandrila has experienced increased surveillance, economic pressure, and periodic crackdowns intended to deter overt support for the Rebellion. While open insurrection on the planet remains rare due to the sheer weight of Imperial presence in the Core, numerous subtle forms of resistance persist: information leaks, financial support funneled through intermediaries, and the quiet relocation of sympathetic citizens into sectors where they can more actively assist the Alliance. Imperial propaganda frequently cites Chandrila as an example of a \"rehabilitated\" world, but intercepted communications and underground reports tell a different story—one of simmering dissent kept in check only by the threat of overwhelming force.\n\nAlliance Intelligence regards Chandrila as both symbol and seedbed. Even when direct action is constrained, the planet continues to produce leaders, organizers, and ideologues whose influence extends far beyond its borders. In many ways, Chandrila represents the kind of society the Alliance hopes to restore on a galactic scale: principled, participatory, and unwilling to surrender its conscience in exchange for imposed order.",
  "gmMode": true,
  "related": [
    { "id": "mon_mothma", "category": "characters" },
    { "id": "rebellion",  "category": "factions"   }
  ]
}
