{
  "id": "dagobah",
  "name": "Dagobah",
  "image": "images/dagobah.png",
  "description": "Dagobah is an uncharted swamp world located in the Outer Rim, officially absent from most navigation charts and deliberately ignored by Imperial survey efforts. The planet’s surface is dominated by dense jungles, mist-laden bogs, and stagnant wetlands teeming with life. Atmospheric readings indicate high humidity, pervasive organic decay, and frequent electrical storms, making long-term habitation difficult for most species. From a conventional strategic perspective, Dagobah holds no known resources, infrastructure, or population centers worth contesting.\n\nWhat makes Dagobah significant to the Alliance is not its material value, but its connection to the Force. Reports from Luke Skywalker describe the world as a place of intense spiritual resonance, where the boundary between the physical and the metaphysical feels unusually thin. This same quality appears to interfere with standard sensing technologies, rendering the planet difficult to locate and its surface nearly impossible to scan accurately. These properties made Dagobah an ideal refuge for Yoda, one of the last surviving Jedi Masters, who used the world’s unique signature to conceal himself from Imperial detection.\n\nDuring his time on Dagobah, Luke Skywalker underwent accelerated training under Yoda’s guidance, confronting not only physical challenges but also visions and trials that forced him to confront his fears, attachments, and assumptions about the nature of the conflict. Accounts suggest that the planet itself, or the concentration of the Force within it, played an active role in shaping these experiences. While the precise mechanics of such phenomena remain beyond the scope of Alliance science, their effects on Skywalker’s development as a Jedi are undeniable.\n\nFor operational purposes, Dagobah is considered a restricted subject. Knowledge of its location is limited to a very small circle within the Alliance, and no official missions have been authorized to or from the system beyond Skywalker’s documented visits. The world stands in Alliance records as a reminder that not all decisive battlefields are measured in troop deployments or tonnage of starships; some exist in the minds and spirits of those who carry the fight forward.",
  "gmMode": true,
  "related": [
    { "id": "yoda",           "category": "characters" },
    { "id": "luke_skywalker", "category": "characters" }
  ]
}
