{
"id": "yavin-4",
"name": "Yavin 4",
"image": "images/yavin-4.jpeg",
"description": "Yavin 4 is a remote jungle moon orbiting the gas giant Yavin in the Outer Rim Territories. Its dense vegetation, humid atmosphere, and network of ancient stone structures make it one of the least charted and least hospitable worlds in the sector. The surface is dominated by sprawling rainforests broken only by massive, vine-covered temples—ruins of a long-vanished civilization known as the Massassi. Archaeological interest in the moon has been limited due to its remoteness and dangerous wildlife, which includes territorial predators and venomous species adapted to the dense canopy. Environmental sensors indicate a high level of bioactivity, making prolonged habitation difficult without significant infrastructure support.\n\nFor Alliance personnel, Yavin 4 has recently drawn attention as a temporary command center due to its isolation and natural cover. The Massassi structures, constructed from dense stone and partially shielded by the surrounding jungle, offer ideal conditions for concealing equipment and establishing fortified operations. Communications from within the system are tightly encrypted and infrequent, as the Rebellion seeks to minimize any traceable transmissions that might alert Imperial surveillance. Few outside the inner command structure are aware of the moon’s precise location, and official records list it only as an abandoned archaeological site to deflect Imperial curiosity.\n\nAt present, Yavin 4 functions as a coordination hub for Alliance logistics and planning, with its base still under development. Supply chains remain unstable, relying on scattered convoys and sympathetic smugglers to maintain secrecy. Despite the challenges, morale among stationed personnel is high; the sense of unity and purpose in the shadow of Yavin’s gas giant gives the outpost a symbolic weight that belies its humble beginnings. Within its ancient halls, the Rebellion is quietly preparing for the next phase of its campaign against the Empire.",
"gmMode": true
}
