{
  "id": "rebellion",
  "name": "Alliance to Restore the Republic",
  "image": "images/rebellion.png",
  "description": "The Alliance to Restore the Republic—commonly referred to simply as the Rebellion—is a decentralized, multi-cell insurgent movement formed in opposition to the authoritarian rule of the Galactic Empire. Unlike earlier, isolated resistance efforts, the Alliance represents a coordinated attempt to unify disparate planetary militias, dissident senators, defected Imperial personnel, and underground networks under a shared command structure and strategic vision. Officially denounced by Imperial propaganda as terrorists and criminals, the Alliance operates with the stated goal of dismantling Imperial rule and re-establishing representative governance across the galaxy.\n\nThe Alliance’s strength lies not in conventional military parity, but in asymmetric warfare, intelligence gathering, and the willingness of its members to operate with minimal resources under extreme risk. Its command structure blends formal hierarchy with operational flexibility: sector cells retain a high degree of autonomy while still answering to a central High Command, allowing local leaders to adapt rapidly to changing conditions without compromising the broader strategic picture. This design also limits the damage of Imperial crackdowns; even when one cell is exposed or destroyed, others can continue operating independently.\n\nAlliance logistics rely on a fragile but resilient network of sympathetic worlds, covert supply lines, and black-market acquisitions. Starfighter forces, trained from both experienced pilots and motivated recruits, execute precision strikes against high-value Imperial assets, while intelligence operatives work to identify vulnerabilities, exploit political fractures, and secure critical data—such as the stolen plans to major Imperial superweapons. Many of the Alliance’s most effective units are composed of individuals with personal histories of loss under Imperial rule, giving the movement a powerful morale base that cannot be easily broken by military defeat alone.\n\nIdeologically, the Alliance is a coalition rather than a monolith. Its ranks include former senators advocating for a return to the old Republic, local leaders seeking autonomy for their homeworlds, military professionals driven by duty, and ordinary citizens unwilling to accept life under Imperial oppression. This diversity can create internal tensions, but it also ensures that the cause is not tied to any single leader, species, or ideology. Should key figures fall, the idea of the Rebellion endures. In every occupied system, in every act of defiance—large or small—the Alliance exists as both a fighting force and a symbol of the galaxy’s refusal to accept tyranny as the final word.",
  "gmMode": true,
  "related": [
    { "id": "leia_organa",     "category": "characters" },
    { "id": "luke_skywalker",  "category": "characters" },
    { "id": "han_solo",        "category": "characters" },
    { "id": "chewbacca",       "category": "characters" },
    { "id": "lando_calrissian","category": "characters" },
    { "id": "mon_mothma",      "category": "characters" },
    { "id": "r2-d2",           "category": "characters" },
    { "id": "c-3po",           "category": "characters" }
  ]
}
