{
  "id": "millennium_falcon",
  "name": "Millennium Falcon",
  "image": "images/millennium_falcon.png",
  "description": "The Millennium Falcon is a heavily modified YT-1300 Corellian light freighter whose unassuming civilian silhouette conceals one of the most notoriously overpowered starships operating anywhere in the galaxy. Originally manufactured for cargo transport and not combat, the vessel has undergone decades of illegal structural alterations, weapons integrations, and hyperdrive enhancements. The exact provenance of many of its upgrades remains unclear, as several components violate both Imperial starship regulations and standard engineering logic. These include a hyperdrive motivator capable of outrunning most military-grade pursuit vessels and sensor countermeasures that allow the ship to disappear from local tracking arrays under conditions that should render stealth impossible.\n\nThe Falcon’s current configuration reflects the personal handiwork of its longstanding crew, particularly Chewbacca, whose mechanical expertise and familiarity with Corellian systems have kept the ship in a state of constant, if temperamental, readiness. Though outwardly battered and frequently dismissed by observers as barely spaceworthy, the freighter demonstrates astonishing resilience and performance once airborne. Its speed, maneuverability, and offensive capability have repeatedly allowed it to break through Imperial blockades, extract high-value personnel, and execute combat maneuvers normally associated with starfighter craft rather than light freighters.\n\nThe Falcon has seen direct action in multiple major engagements supporting the Alliance to Restore the Republic. Intelligence analysts have flagged the ship as a recurring anomaly in Imperial after-action reports—its appearance often correlating with mission failures, unexplained escapes, or the sudden reversal of Imperial tactical advantages. While officially cataloged as an independent asset operated by Han Solo and Chewbacca, the vessel has become an unofficial symbol of rebellion ingenuity and defiance. Its history of improbable survivals and impossible victories has elevated it to near-mythic status within the ranks of Alliance personnel.\n\nDespite its reputation, the Millennium Falcon remains notoriously unpredictable. Maintenance crews report that the vessel’s systems do not always conform to standard schematics, and field technicians are advised to consult its co-pilot before attempting any adjustments. Nevertheless, the ship’s unique combination of speed, firepower, and clandestine modifications makes it one of the most valuable independent assets available to Alliance operations. It may look like a \"hunk of junk\" to the casual observer, but those who have seen it in action understand that underestimating the Falcon is a mistake few survive long enough to repeat.",
  "gmMode": true,
  "related": [
    { "id": "rebellion",      "category": "factions"   },
    { "id": "han_solo",       "category": "characters" },
    { "id": "chewbacca",      "category": "characters" },
    { "id": "luke_skywalker", "category": "characters" },
    { "id": "leia_organa",    "category": "characters" },
    { "id": "corellia",       "category": "planets"    }
  ]
}
