{
  "id": "operation_blue_lantern",
  "title": "Operation: Blue Lantern",
  "classification": "RESTRICTED — Alliance Intelligence (Level 3)",
  "priority": "low",
  "for": "Phoenix Cell — Recruit Team \"Sparrow\"",
  "issued_by": "Lt. Mara Venn, Alliance Intelligence (Forward Ops)",
  "date": "Two weeks after the Battle of Yavin",
  "overview": "You are not being sent to topple an Empire today. This mission is deliberately low-priority in the grand campaign — suitable for new recruits to gain field experience while delivering immediate, practical value to frontline units. The Alliance has identified a small Imperial logistics node on the ice-mining moon Kestrel-9 (Outer Rim — Tion Sector). The node services a local squadron of patrol fighters and resupplies nearby ground outposts. Recent rebel raids in other sectors have stretched Alliance resources; Kestrel-9 is not a high-priority target for major strikes, but its supply manifests and patrol rotations contain information that will help Alliance cells plan safe courier routes and anticipate Imperial patrol windows.",
  "mission": "Infiltrate the logistics node, obtain the latest shipping manifest and patrol rotations from the station’s secure terminal (data-port \"VEGA-3\"), upload a forged 'maintenance manifest' to obscure Alliance tampering, and return with the manifests and a single low-risk physical sample (fuel canister tag) for lab verification. Avoid large-scale sabotage.",
  "objectives": [
    {
      "priority": "primary",
      "description": "Recover the station’s current shipping manifest and patrol rotation logs from terminal VEGA-3 (digital copy + physical datacard if found)."
    },
    {
      "priority": "secondary",
      "description": "Upload the prepared forged maintenance manifest to the logistics server to cover Alliance access for 72 hours."
    },
    {
      "priority": "tertiary",
      "description": "If safe, retrieve a single labeled fuel canister tag (stamped 'Imperial Resupply — Batch 7A'). No extra scavenging."
    }
  ],
  "success_criteria": "Team returns with the manifest (digital) and confirmation the forged manifest is live on the server. No unnecessary firefights. Minimal trace.",
  "rationale": "The manifest will reveal short-term Imperial flight and convoy plans in the Tion Sector, enabling safe passage for Alliance couriers and informing small-squad harassment ops. The forged manifest creates a temporary administrative blindspot that allows future Alliance retrievals with reduced scrutiny. This is a training opportunity for low-complexity infiltration and data-exfiltration.",
  "team_composition": {
    "sparrow_1": "Team Lead — overall mission, comms, exfil decisions",
    "sparrow_2": "Hacker/Tech — primary access to VEGA-3, upload forged manifest",
    "sparrow_3": "Recon/Scout — perimeter watch, patrol tracking",
    "sparrow_4": "Comms/Support — relay to cell safehouse, carry physical sample, close-quarters backup"
  },
  "insertion": {
    "method": "Underslung shuttle drop 7 km from station, under ice-shadow",
    "local_time": "0200 (Kestrel-9 standard)",
    "notes": "Insert on foot; thermal cover provided by aurora activity."
  },
  "extraction": {
    "rendezvous": "Docking ring east-berth (Echo-4)",
    "shuttle_call_sign": "Wren",
    "pickup_window": "Shuttle will land 12 minutes after extraction call",
    "fallback_rally_point": "Abandoned fuel silo 'Silo B-12' (3.4 km north) if extraction fails"
  },
  "time_window": "Single 90-minute on-station window before the scheduled supply run (intel). Overstay increases risk.",
  "intelligence_summary": {
    "garrison": "Small logistics detail — 1 officer, 6 station technicians, 2 maintenance droids, rotating patrols (2 personnel per shift). No heavy garrison recorded.",
    "defenses": "Perimeter sensor net, low-power ion fence, a single light automated AA turret. No fighters permanently stationed.",
    "vega_3": "Administrative terminal inside Logistics Office B. Access requires a level-2 maintenance key or terminal override. Data mirrors to local datacard once per shift (typically in supervisor's locker).",
    "local_hazards": "Thin ice ridges and frequent microstorms — movement impeded; short comms degradation possible."
  },
  "equipment_and_assets": {
    "standard_recruit_pack": [
      "Cold-weather suit",
      "3 stim-packs",
      "2 ion grenades",
      "Compact vibroblade",
      "Single short-range blaster",
      "EMP patch (for turret)",
      "Comm scrambler",
      "Data-slate",
      "Forged maintenance manifest (encrypted)",
      "Climbing kit"
    ],
    "provided": [
      "Short-range shuttle (Wren)",
      "False Imperial maintenance coveralls and ID blips",
      "Holoprojector for short visual cloaking in corridors"
    ]
  },
  "rules_of_engagement": [
    "Avoid lethal force where possible. Capture/neutralize only if mission compromised and no alternative.",
    "Do not destroy the terminal or major infrastructure; data must remain intact.",
    "Do not use the forged manifest for anything beyond the upload on this mission.",
    "Minimize interaction with civilians or local miners; avoid attracting attention."
  ],
  "communications_and_authentication": {
    "primary_channel": "Encrypted Sparrow Net (burst transmissions only)",
    "auth_passphrase": "\"Blue ember\" / \"Green ember\" (rotate per procedure)",
    "abort_code": "\"Nightfall\" (immediate withdrawal if issued by command or Sparrow-1)"
  },
  "contingencies": {
    "compromised_infiltration": "Break contact and exfil immediately. Leave one diversionary EMP charge in outer corridor if practical to slow pursuit.",
    "terminal_access_denied": "Secure any physical datacard from supervisor locker. If neither available, withdraw. Partial intel acceptable.",
    "extraction_missed": "Move to Silo B-12 and hold until shuttle re-tasked. Keep radios quiet; wait scheduled pickup + 2 hours, then consider sub-orbital rig as last resort."
  },
  "timing_and_sequence": [
    "Insert — approach under ice-shadow (T+0)",
    "Breach perimeter — avoid sensors; use scrambler window (T+5–12)",
    "Secure Logistics Office B — neutralize droid, clear hallway (T+15)",
    "VEGA-3 access — Sparrow-2 to extract manifests, upload forged file (T+20–45)",
    "Retrieve physical datacard/tag if present (T+25–50)",
    "Exfil — return to Echo-4 for shuttle pickup (T+60–90)"
  ],
  "known_unknowns_and_risks": [
    "Patrol rotation changes since last scan.",
    "Possible presence of an Imperial officer on inspection; avoid interaction.",
    "Storms may interrupt comms and shuttle approach/landing windows."
  ],
  "command_intent_and_morale": "You are a small piece of a large effort. Nothing about this mission will make holofeed headlines, but the information you bring back will be immediately useful to cells that carry out courier missions and small raids. This is how you learn tradecraft and how the Alliance threads small acts into larger strategy. Bring back the manifest. Bring back your team.",
  "authorizing_officer": "Lt. Mara Venn, Alliance Intelligence, Forward Ops"
}
