{
  "id": "chewbacca",
  "name": "Chewbacca",
  "image": "images/chewbacca.png",
  "description": "Chewbacca of Kashyyyk—commonly referred to simply as \"Chewie\" in Alliance reports—is a Wookiee warrior and veteran of multiple conflicts predating the formal rise of the Rebellion. Born into the dense wroshyr forests of Kashyyyk, Chewbacca’s early record with the Republic-era military is fragmentary but indicates prior contact with Jedi and Clone Wars–era campaigns against Separatist forces. Following the transition from Republic to Empire, he witnessed first-hand the subjugation of his homeworld and the systematic enslavement of his people. Surviving intelligence suggests Chewbacca was captured and forced into Imperial labor, an experience that shaped his enduring hostility toward Imperial authority and contributed to his later alignment with insurgent efforts across the galaxy.\n\nChewbacca’s eventual escape from Imperial control led to his fateful partnership with Han Solo. While details vary between sources, the most consistent account indicates that Solo intervened on Chewbacca’s behalf during an Imperial operation, risking his own status in the process. In accordance with Wookiee life-debt traditions, Chewbacca pledged his loyalty to Solo, remaining at his side as co-pilot of the heavily modified YT-1300 freighter Millennium Falcon. Within Alliance circles, this partnership is considered one of the most effective two-being crews operating in the Outer Rim. Chewbacca’s physical strength, combat instincts, and technical aptitude with starship repair complement Solo’s impulsive piloting style, creating a unit capable of surviving encounters that should, statistically, be unsurvivable.\n\nThough his vocalizations are primarily limited to Shyriiwook, Chewbacca’s communication with trusted allies is clear, direct, and frequently laced with dry humor. Multiple field agents have noted that he possesses a keen tactical sense and a strong protective instinct toward members of his extended “pack,” a group that now includes key Alliance figures such as Leia Organa and Luke Skywalker. In combat, Chewbacca favors his signature bowcaster, delivering high-impact shots with unnerving accuracy, and is fully capable of devastating close-quarters engagements when required. Off the battlefield, he has proven surprisingly patient in dealing with damaged equipment, malfunctioning droids, and the Falcon’s idiosyncrasies, often serving as the de facto engineer keeping the ship flightworthy.\n\nAlliance Intelligence assesses Chewbacca as an invaluable asset whose loyalty is absolute once earned. His presence significantly enhances the operational effectiveness and survivability of any mission involving the Millennium Falcon. While he rarely seeks recognition, internal reports make clear that many of the Rebellion’s most daring escapes and sudden reversals of fortune could not have occurred without the quiet, steadfast contributions of this Wookiee warrior.",
  "gmMode": true,
  "related": [
    { "id": "rebellion",         "category": "factions"   },
    { "id": "han_solo",          "category": "characters" },
    { "id": "leia_organa",       "category": "characters" },
    { "id": "luke_skywalker",    "category": "characters" },
    { "id": "millennium_falcon", "category": "vehicles"   },
    { "id": "kashyyyk",          "category": "planets"    }
  ]
}
