{
  "id": "han_solo",
  "name": "Han Solo",
  "image": "images/han_solo.png",
  "description": "Han Solo entered Alliance records not as a volunteer insurgent, but as an independent contractor whose interests were, by his own repeated admission, \"strictly business.\" A Corellian by birth and former Imperial Academy cadet, Solo’s service record is fragmentary and heavily redacted, but surviving files suggest he was expelled under circumstances involving insubordination and unauthorized interference with an Imperial operation. Following his dismissal, he resurfaced in multiple sector security bulletins as a smuggler operating along the Corellian Run and neighboring hyperlanes, most often in the heavily modified YT-1300 freighter later identified as the Millennium Falcon. His reputation in underworld circles is that of a pilot willing to take high-risk cargo for the right price, backed by a Wookiee partner whose presence alone discourages disputes over payment.\n\nSolo’s relationship with the Alliance began as a transactional arrangement: safe passage, last-minute extractions, and discreet cargo runs in exchange for hard credits. Despite his professed neutrality and skepticism toward the cause, field reports indicate he repeatedly accepted missions that offered poor margins and high personal risk when the stakes involved Alliance personnel—most notably the extraction of key rebel assets from Imperial pursuit in the Outer Rim. His performance during these engagements has been consistently rated as exemplary from a tactical standpoint. Solo demonstrates exceptional spatial awareness in combat, an intuitive grasp of risk versus reward, and a talent for improvisation when conventional plans collapse. These traits, combined with the Falcon’s extreme speed and unregistered modifications, make him uniquely valuable for infiltration, exfiltration, and rapid deployment operations.\n\nWhile Solo maintains a veneer of cynicism and professed self-interest, Alliance Intelligence assesses this as, in part, a deliberate defense mechanism. Multiple accounts from pilots and command staff describe him returning to battle zones after being formally released from obligation, intervening at critical moments to turn the tide of an engagement. His growing personal ties to prominent Alliance figures—most notably Leia Organa and Luke Skywalker—appear to have shifted his loyalties from purely transactional to genuinely invested. Officially, Han Solo is still cataloged as a freelance asset and starship captain operating in support of Alliance objectives. Unofficially, many in the command staff already consider him one of the Rebellion’s most reliable, if reluctant, heroes.",
  "gmMode": true,
  "related": [
    { "id": "rebellion",         "category": "factions"   },
    { "id": "leia_organa",       "category": "characters" },
    { "id": "luke_skywalker",    "category": "characters" },
    { "id": "chewbacca",         "category": "characters" },
    { "id": "millennium_falcon", "category": "vehicles"   }
  ]
}
