{
"id": "luke_skywalker",
"name": "Luke Skywalker",
"image": "images/luke_skywalker.jpeg",
"description": "Luke Skywalker first came to the attention of Alliance Intelligence during the latter days of the Galactic Civil War, when reports began circulating of a promising pilot from the Outer Rim. Hailing from the remote world of Tatooine, Skywalker was initially known only as a local farmhand with an uncommon skill for flying T-16 skyhoppers through the treacherous canyons near Beggar’s Canyon. His mechanical aptitude and quick reflexes marked him as a natural candidate for recruitment, though little else in his background suggested the makings of a hero. That changed abruptly when he became entangled in events surrounding the theft and delivery of the Death Star plans.\n\nAccording to multiple field accounts, Skywalker played a critical role in delivering R2-D2—an astromech unit containing vital tactical data stolen from Imperial archives—to Alliance forces stationed on Yavin IV. Following the data’s successful decryption, Skywalker volunteered for active combat duty and was assigned to Red Squadron under Commander Garven Dreis. Despite having no prior combat experience in space warfare, his precision flying and ability to remain composed under fire impressed his superiors. During the ensuing Battle of Yavin, Skywalker’s leadership and instinct proved decisive. Flying as Red Five, he was among the final pilots to make a trench run on the Death Star’s thermal exhaust port, executing the critical shot that led to the station’s destruction.\n\nAlliance analysts later described his performance as a near-impossible combination of skill and intuition, with telemetry data indicating the final targeting computer was disengaged moments before the shot was fired. The specifics of how he achieved such accuracy remain the subject of speculation and classified review. In the aftermath of the battle, Skywalker was officially commended for extraordinary valor and promoted within the Alliance Starfighter Corps. His contributions are credited not only with ensuring the survival of the Rebel Alliance but also with demonstrating that even an untested pilot from the Outer Rim could alter the course of galactic history.",
"gmMode": true
}
