{
  "id": "maul",
  "name": "Maul",
  "image": "images/maul.png",
  "description": "Designated in most historical Republic-era records simply as \"Darth Maul,\" this Zabrak warrior was once believed killed during the closing stages of the Naboo crisis. Subsequent intelligence, gathered piecemeal over years of scattered encounters, indicates that Maul not only survived but continued to operate from the shadows, reshaping himself as a warlord and criminal power broker outside the formal structures of the Sith. Physically, Maul is characterized by his red-and-black skin markings, cranial horns, and extensive cybernetic augmentation to his lower body—a testament to both the severity of his injuries and his formidable will to endure.\n\nDuring the Clone Wars, Maul resurfaced as the architect of the so-called Shadow Collective, an alliance of criminal syndicates and militant factions used to seize control of key worlds, including Mandalore. Republic and Jedi sources from that era describe him as a highly skilled combatant specializing in aggressive lightsaber forms, psychological intimidation, and precision strikes against political targets. His vendetta against both the Jedi Order and his former Sith master led him to orchestrate convoluted schemes designed to destabilize entire regions, often at the cost of immense civilian suffering.\n\nWith the fall of the Republic and the rise of the Empire, Maul appeared to pivot away from overt military campaigns toward a more covert model of power. Intelligence correlating underworld symbols, intercepted communications, and eyewitness accounts strongly suggests that Maul exerted direct control over Crimson Dawn, using it as both a revenue source and a clandestine influence network. Within this framework, operatives such as Qi'ra functioned as his visible intermediaries, while Maul himself remained largely unseen, emerging only when necessary to enforce his will or realign the organization’s priorities through fear and violence.\n\nFrom the Alliance perspective, Maul represents an unpredictable third-party actor whose objectives intersect only incidentally with those of the Rebellion. He harbors profound hatred for the Sith-ruled Empire but is ultimately loyal only to his own ambitions. Any direct engagement with Maul or his proxies carries extreme risk; he is a strategist who favors long games, uses allies as expendable pieces, and has repeatedly demonstrated a capacity to survive defeats that would end lesser beings. Until more is known about his current whereabouts and resources, Maul is to be treated as a Tier-One threat: not a primary focus of Alliance operations, but a dangerous wildcard whose presence can dramatically alter the balance of power wherever he chooses to intervene.",
  "gmMode": true,
  "related": [
    { "id": "crimson_dawn",  "category": "factions"   },
    { "id": "qira",          "category": "characters" },
    { "id": "dathomir",      "category": "planets"    },
    { "id": "mandalore",     "category": "planets"    }
  ]
}
