{
  "id": "mon_mothma",
  "name": "Mon Mothma",
  "image": "images/mothma.jpeg",
  "description": "Mon Mothma serves as one of the principal architects and public faces of the Alliance to Restore the Republic. Formerly a senator of Chandrila in the Galactic Senate, she broke ranks with the Imperial regime through a series of increasingly bold speeches condemning the erosion of civil liberties, the militarization of the state, and the persecution of whole worlds under Imperial rule. Her formal declaration of opposition—broadcast at great personal risk—forced her into exile and transformed her from a dissident politician into a full-time leader of organized rebellion.\n\nWithin Alliance High Command, Mon Mothma occupies a role that is equal parts strategist, diplomat, and moral compass. She coordinates efforts between disparate cells, planetary militias, and sympathetic systems, using her reputation and political experience to persuade cautious leaders to commit fully to the cause. Her approach emphasizes unity and long-term stability: she is acutely aware that defeating the Empire is only the first step, and that what follows must not simply recreate the failings of the old Republic. As a result, she encourages transparency and shared governance wherever possible, even in the midst of a desperate war.\n\nField reports consistently describe Mon Mothma as calm, measured, and unwavering in her principles, even when circumstances demand hard choices. She is known to visit front-line bases and covert outposts whenever security conditions allow, meeting with rank-and-file personnel to hear their concerns and reinforce the broader purpose of their sacrifices. Though not a soldier by training, she fully understands the cost of the conflict and has demonstrated a willingness to authorize high-risk operations when the potential gains justify the risk. In private, those closest to her acknowledge the heavy personal burden she carries, balancing the lives lost today against the hope of a free galaxy tomorrow.\n\nAlliance Intelligence assesses Mon Mothma as an irreplaceable political and symbolic asset. Her presence legitimizes the Rebellion in the eyes of neutral systems, and her vision provides a guiding framework for what might one day replace the Empire. Should she fall, the Alliance would endure, but the path forward would become far more uncertain.",
  "gmMode": true,
  "related": [
    { "id": "rebellion",      "category": "factions"   },
    { "id": "leia_organa",    "category": "characters" },
    { "id": "luke_skywalker", "category": "characters" },
    { "id": "chandrila",      "category": "planets"    }
  ]
}
